[
  "At the end of each turn, if the Pokémon this card is attached to is affected by any Special Conditions, it recovers from all of them, and discard this card.",
  "At the end of your turn, if the Pokémon this card is attached to is in the Active Spot, heal 10 damage from that Pokémon.",
  "Attacks used by the Ultra Beast this card is attached to do +10 damage to your opponent's Active Pokémon for each point you have gotten.",
  "Choose 1 of your Alolan Marowak or Turtonator. Take 2 {R} Energy from your Energy Zone and attach it to that Pokémon. Your turn ends.",
  "Choose 1 of your Basic Pokémon in play. If you have a Stage 2 card in your hand that evolves from that Pokémon, put that card onto the Basic Pokémon to evolve it, skipping the Stage 1. You can't use this card during your first turn or on a Basic Pokémon that was put into play this turn.",
  "Choose 1 of your Electivire or Luxray. Attach 2 {L} Energy from your discard pile to that Pokémon.",
  "Choose 1 of your Palossand or Mimikyu that has damage on it, and move 40 of its damage to your opponent's Active Pokémon.",
  "Choose 1 of your {W} Pokémon, and flip a coin until you get tails. For each heads, take a {W} Energy from your Energy Zone and attach it to that Pokémon.",
  "Choose 1:\n\nDuring this turn, attacks used by your Pokémon that evolve from Eevee do +10 damage to your opponent's Active Pokémon.\n\nHeal 20 damage from each of your Pokémon that evolves from Eevee.",
  "Choose a Pokémon in your hand and switch it with a random Pokémon in your deck.",
  "Discard all Pokémon Tool cards attached to each of your opponent's Pokémon.",
  "Draw 2 cards.",
  "During this turn, attacks used by your Alolan Golem, Vikavolt, or Togedemaru do +30 damage to your opponent's Active Pokémon.",
  "During this turn, attacks used by your Decidueye ex, Incineroar ex, or Primarina ex do +30 damage to your opponent's Active Pokémon.",
  "During this turn, attacks used by your Garchomp or Togekiss do +50 damage to your opponent's Active Pokémon.",
  "During this turn, attacks used by your Ninetales, Rapidash, or Magmar do +30 damage to your opponent's Active Pokémon.",
  "During this turn, attacks used by your Pokémon do +10 damage to your opponent's Active Pokémon.",
  "During this turn, attacks used by your Pokémon do +20 damage to your opponent's Active Pokémon ex.",
  "During this turn, attacks used by your Snorlax, Heracross, and Staraptor cost 2 less {C} Energy.",
  "During this turn, the Retreat Cost of your Active Pokémon is 1 less.",
  "During this turn, the Retreat Cost of your Active Pokémon is 2 less.",
  "During your opponent's next turn, all of your Pokémon take −10 damage from attacks from your opponent's Pokémon.",
  "During your opponent's next turn, all of your {M} Pokémon take −20 damage from attacks from your opponent's Pokémon.",
  "Each player shuffles the cards in their hand into their deck, then draws that many cards.",
  "Flip a coin until you get tails. For each heads, discard a random Energy from your opponent's Active Pokémon.",
  "Heal 10 damage and remove a random Special Condition from your Active Pokémon.",
  "Heal 20 damage from 1 of your Pokémon.",
  "Heal 30 damage from 1 of your Pokémon, and it recovers from all Special Conditions.",
  "Heal 40 damage from each of your Pokémon that has any {W} Energy attached.",
  "Heal 50 damage from 1 of your {G} Pokémon.",
  "Heal 60 damage from 1 of your Stage 2 Pokémon.",
  "Heal all damage from 1 of your Shiinotic or Tsareena. If you do, discard all Energy from that Pokémon.",
  "If the Pokémon this card is attached to is in the Active Spot and is damaged by an attack from your opponent's Pokémon, do 20 damage to the Attacking Pokémon.",
  "If the Pokémon this card is attached to is your Active Pokémon and is damaged by an attack from your opponent's Pokémon, the Attacking Pokémon is now Poisoned.",
  "If the {L} Pokémon this card is attached to is in the Active Spot and is Knocked Out by damage from an attack from your opponent's Pokémon, move 2 {L} Energy from that Pokémon and attach 1 Energy each to 2 of your Benched Pokémon.",
  "Look at a random Supporter card that's not Penny from your opponent's deck and shuffle it back into their deck. Use the effect of that card as the effect of this card.",
  "Look at the top 3 cards of your deck.",
  "Look at the top card of your deck. If that card is a {P} Pokémon, put it into your hand. If it is not a {P} Pokémon, put it on the bottom of your deck.",
  "Look at the top card of your deck. Then, you may shuffle your deck.",
  "Move all {L} Energy from your Benched Pokémon to your Raichu, Electrode, or Electabuzz in the Active Spot.",
  "Move an Energy from 1 of your Benched Pokémon to your Active Pokémon.",
  "Play this card as if it were a 40-HP Basic {C} Pokémon.\nAt any time during your turn, you may discard this card from play.\nThis card can't retreat.",
  "Play this card as if it were a 40-HP Basic {C} Pokémon. At any time during your turn, you may discard this card from play. This card can't retreat.",
  "Put 1 of your {C} Pokémon that has damage on it into your hand.",
  "Put 1 random Basic Pokémon from your discard pile into your hand.",
  "Put 1 random Glameow, Stunky, or Croagunk from your deck into your hand.",
  "Put 1 random Type: Null or Silvally from your deck into your hand.",
  "Put a Basic Pokémon from your opponent's discard pile onto their Bench.",
  "Put a random Basic Pokémon from your deck into your hand.",
  "Put a random Basic {W} Pokémon from your discard pile into your hand.",
  "Put your Mew ex in the Active Spot into your hand.",
  "Put your Muk or Weezing in the Active Spot into your hand.",
  "Switch in 1 of your opponent's Benched Pokémon that has damage on it to the Active Spot.",
  "Switch out your opponent's Active Basic Pokémon to the Bench. (Your opponent chooses the new Active Pokémon.)",
  "Switch out your opponent's Active Pokémon to the Bench. (Your opponent chooses the new Active Pokémon.)",
  "Take 1 {F} Energy from your Energy Zone and attach it to your Golem or Onix.",
  "The Pokémon this card is attached to gets +20 HP.",
  "The {G} Pokémon this card is attached to gets +30 HP.",
  "You can use this card only if you have Araquanid in play. Switch in 1 of your opponent's Benched Pokémon to the Active Spot.",
  "You can use this card only if your opponent has gotten at least 1 point.\n\nChoose 1 of your Ultra Beasts. Attach 2 random Energy from your discard pile to that Pokémon.",
  "You can use this card only if your opponent hasn't gotten any points.\n\nDuring your opponent's next turn, all of your Ultra Beasts take −20 damage from attacks from your opponent's Pokémon.",
  "Your opponent reveals all of the Supporter cards in their deck.",
  "Your opponent reveals their hand.",
  "Your opponent shuffles their hand into their deck and draws 3 cards.",
  "Your opponent shuffles their hand into their deck and draws a card for each of their remaining points needed to win."
]